
import re
print(re.findall('.','ka47!\n@#$%^&*((":\r'))  #匹配非换行的所有字符
#['k', 'a', '4', '7', '!', '@', '#', '$', '%', '^', '&', '*', '(', '(', '"', ':', '\r']
print(re.findall('\w','ka47!\n@#$%^&*((":\r')) #匹配数字或者字符下划线
#['k', 'a', '4', '7']
print(re.findall('\s','ka47!\n@#$%^&*((":\r')) #匹配空
#['\n', '\r']
print(re.findall('\S','ka47!\n@#$%^&*((":\r')) #匹配非空
#['k', 'a', '4', '7', '!', '@', '#', '$', '%', '^', '&', '*', '(', '(', '"', ':']
print(re.findall('\d','ka47!\n@#$%^&*((":\r')) #匹配数字
#['4', '7']
