
import re

#1.思考:匹配数字  0个~无穷多个
print(re.findall("[0-9]\d{,}",'1111111111111111111')) #['1111111111111111111']
#简写 {,}可以简写为 *
print(re.findall("[0-9]\d*",'1111111111111111111')) #['1111111111111111111']

#2.思考：匹配数字 1个~无穷多个
print(re.findall("[0-9]\d{1,}",'12')) #['12']
#简写 {1,}可以简写为 +
print(re.findall("[0-9]\d+",'1')) #[]
print(re.findall("\d\d+",'1')) #[]

#2.思考：匹配数字 0个或者1个
print(re.findall("[0-9]\d{0,1}",'12345')) #['12', '34', '5']
#简写 {0,1}可以简写为 ？
print(re.findall("[0-9]\d?",'12345')) #['12', '34', '5']
